marquesbill/RTLSEsp32/firmware/ancora-c3/sdkconfig.defaults
# Alvo fixo. NAO e redundante com o `idf.py set-target` nem com o `target:` da CI:
# sem esta linha, um clone novo configura para "esp32" (o default do IDF), e a
# ESP32 classica nao tem BLE 5.0 -> SOC_BLE_50_SUPPORTED=n -> o menu inteiro do
# BLE 5 some do Kconfig e as tres linhas de EXT_ADV abaixo sao DESCARTADAS EM
# SILENCIO. O build so morre 97% depois, em malha.c, com "implicit declaration of
# ble_gap_ext_adv_start" — um erro que nao fala do alvo. MEDIDO nesta caixa.
CONFIG_IDF_TARGET="esp32c3"

# BLE 5.0 extended scan — a razao de a C3 existir neste projeto. As libs
# pre-compiladas do core Arduino trazem EXT_ADV/EXT_SCAN DESLIGADOS, por isso
# este firmware e ESP-IDF e nao Arduino.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=y
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# SuperMini nao expoe UART0 no USB: o console tem de sair pelo USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# log do NimBLE roubaria banda do fluxo @b
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
# app de 3 MB: com WiFi o firmware passou de 95% da particao padrao de 1 MB
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="particoes.csv"
# a C3 SuperMini Plus tem 4 MB; o default de 2 MB nao comporta a particao de 3 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
